/* ctime example */
#include <stdio.h>      /* printf */
#include <time.h>       /* time_t, time, ctime */

int main ()
{
  time_t rawtime;

  time (&rawtime);
  printf ("The current local time is: %s", ctime (&rawtime));

  return 0;
}
//Кодот користи функции од библиотеката time.h, time и ctime, за да ја отпечати моменталната локална временска ситуација.
//Прво се декларира променлива time_t rawtime, која се користи за чување на моменталното време.
//Затоа што програмата го користи моменталното време, функцијата time() се користи за да се добие моменталното време во секунди и да се зачува во rawtime.
//Потоа, се повикува функцијата ctime() и се предава моменталното време како аргумент. Функцијата ctime() го конвертира time_t вредноста во стринг и го враќа како покажувач на таа низа од знаци.
//Во овој случај, отпечатувањето на вредноста на овој покажувач со користење на printf го прикажува моменталното локално време.